<?php

return [
    'admin' => [
        'chart' => [
            'upload' => 'Данные для графика загруженны',
        ],
        'default' => [
            'create' => [
                'success' => 'Запись успешно добавлена',
                'fail' => 'Ошибка добавления записи',
            ],
            'update' => [
                'success' => 'Запись успешно обновлена',
                'fail' => 'Ошибка обновления записи',
            ],
            'delete' => [
                'success' => 'Запись удалена',
            ],
        ],
        'image' => [
            'delete' => [
                'success' => 'Изображение удалено',
                'fail' => 'Ошибка удаления изображения',
            ],
        ],
        'data' => [
            'create' => [
                'success' => 'Значения успешно внесены',
                'fail' => 'Вы не добавили ни одного значения.',
            ],
        ],
        'user' => [
            'create' => [
                'success' => 'Пользователь успешно добавлен',
                'fail' => 'Ошибка добавления пользователя',
            ],
            'update' => [
                'success' => 'Пользователь успешно обновлен',
                'fail' => 'Ошибка обновления пользователя',
            ],
            'delete' => [
                'success' => 'Пользователь удален',
            ],
        ],
    ],
    'public' => [
        'subscription' => [
            'create' => [
                'success' => 'Спасибо за подписку!',
            ],
        ],
    ],
];
